In [1]:
# !pip install pymongo

import pymongo

In [3]:
from pymongo import MongoClient

In [4]:
db = MongoClient('mongodb://localhost:27017')

#### List all the database

In [5]:
print(db.list_database_names())

['admin', 'config', 'demo', 'local', 'mdb1']

In [7]:
mydb = db["demo"]    # database 
col = mydb["test1"]  # collection inside database

#### Display all records

In [8]:
r = col.find()
for i in r:
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e34'), 'Name': 'Vipul', 'Age': 25, 'City': 'Noida', 'Score': 83, 'Dept': 'HR'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}
{'_id': ObjectId('6360dad9264a20f883771e37'), 'Name': 'Mudit', 'Age': 23, 'City': 'Mumbai', 'Score': 80, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e39'), 'Name': 'Akanksha', 'Age': 25, 'City': 'Noida', 'Score': 70, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e3a'), 'Name': 'Anuj', 'Age': 22, 'City': 'Mumbai', 'Score': 68, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Age': 24, 'City': 'Bangalore', 'Score': 94, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}

### CRUD

#### Insert single record

In [9]:
rec1 = {'Name': 'Anshul', 'Age': 23, 'City': 'Noida', 'Score': 92, 'Dept': 'IT'}
x = col.insert_one(rec1)

print(x.inserted_id)

6360df13c570d4ceb9bd88e3

In [10]:
for i in col.find():
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e34'), 'Name': 'Vipul', 'Age': 25, 'City': 'Noida', 'Score': 83, 'Dept': 'HR'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}
{'_id': ObjectId('6360dad9264a20f883771e37'), 'Name': 'Mudit', 'Age': 23, 'City': 'Mumbai', 'Score': 80, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e39'), 'Name': 'Akanksha', 'Age': 25, 'City': 'Noida', 'Score': 70, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e3a'), 'Name': 'Anuj', 'Age': 22, 'City': 'Mumbai', 'Score': 68, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Age': 24, 'City': 'Bangalore', 'Score': 94, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360df13c570d4ceb9bd88e3'), 'Name': 'Anshul', 'Age': 23, 'City': 'Noida', 'Score': 92, 'Dept': 'IT'}

#### Insert multiple Records

In [12]:
records = [{'Name': 'Jatin', 'Age': 22, 'City': 'Delhi', 'Score': 75, 'Dept': 'INV'},
          {'Name': 'Kritika', 'Age': 24, 'City': 'Pune', 'Score': 87, 'Dept': 'HR'},
          {'Name': 'Akash', 'Age': 26, 'City': 'Mumbai', 'Score': 56, 'Dept': 'LOG'}]

x = col.insert_many(records)

print(x.inserted_ids)

[ObjectId('6360e01dc570d4ceb9bd88e4'), ObjectId('6360e01dc570d4ceb9bd88e5'), ObjectId('6360e01dc570d4ceb9bd88e6')]

In [13]:
for i in col.find():
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e34'), 'Name': 'Vipul', 'Age': 25, 'City': 'Noida', 'Score': 83, 'Dept': 'HR'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}
{'_id': ObjectId('6360dad9264a20f883771e37'), 'Name': 'Mudit', 'Age': 23, 'City': 'Mumbai', 'Score': 80, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e39'), 'Name': 'Akanksha', 'Age': 25, 'City': 'Noida', 'Score': 70, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e3a'), 'Name': 'Anuj', 'Age': 22, 'City': 'Mumbai', 'Score': 68, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Age': 24, 'City': 'Bangalore', 'Score': 94, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360df13c570d4ceb9bd88e3'), 'Name': 'Anshul', 'Age': 23, 'City': 'Noida', 'Score': 92, 'Dept': 'IT'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e4'), 'Name': 'Jatin', 'Age': 22, 'City': 'Delhi', 'Score': 75, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e5'), 'Name': 'Kritika', 'Age': 24, 'City': 'Pune', 'Score': 87, 'Dept': 'HR'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e6'), 'Name': 'Akash', 'Age': 26, 'City': 'Mumbai', 'Score': 56, 'Dept': 'LOG'}

#### Select Operations

In [15]:
# select * from test1 where DEPT='IT'

q1 = {'Dept':'IT'}
for i in col.find(q1):
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3a'), 'Name': 'Anuj', 'Age': 22, 'City': 'Mumbai', 'Score': 68, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Age': 24, 'City': 'Bangalore', 'Score': 94, 'Dept': 'IT'}
{'_id': ObjectId('6360df13c570d4ceb9bd88e3'), 'Name': 'Anshul', 'Age': 23, 'City': 'Noida', 'Score': 92, 'Dept': 'IT'}

#### Less than Grt than
<pre>
Less than - $lt
Less than Equal to - $lte
Greater than - $gt
Greater than Equal to - $gte
</pre>

In [17]:
q2 = {'Age':{'$gte':24}}   # greater than
for i in col.find(q2):
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e34'), 'Name': 'Vipul', 'Age': 25, 'City': 'Noida', 'Score': 83, 'Dept': 'HR'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e39'), 'Name': 'Akanksha', 'Age': 25, 'City': 'Noida', 'Score': 70, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Age': 24, 'City': 'Bangalore', 'Score': 94, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e5'), 'Name': 'Kritika', 'Age': 24, 'City': 'Pune', 'Score': 87, 'Dept': 'HR'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e6'), 'Name': 'Akash', 'Age': 26, 'City': 'Mumbai', 'Score': 56, 'Dept': 'LOG'}

#### Sorting

#### 1) Ascending Order

In [19]:
q3 = {'City':'Delhi'}
for i in col.find(q3).sort('Name'):
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e4'), 'Name': 'Jatin', 'Age': 22, 'City': 'Delhi', 'Score': 75, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}

#### 2) Descending Order

In [20]:
q4 = {'Age':{'$lt':24}}
for i in col.find(q4).sort('Name',-1):  # name in descending
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e37'), 'Name': 'Mudit', 'Age': 23, 'City': 'Mumbai', 'Score': 80, 'Dept': 'LOG'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e4'), 'Name': 'Jatin', 'Age': 22, 'City': 'Delhi', 'Score': 75, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e3a'), 'Name': 'Anuj', 'Age': 22, 'City': 'Mumbai', 'Score': 68, 'Dept': 'IT'}
{'_id': ObjectId('6360df13c570d4ceb9bd88e3'), 'Name': 'Anshul', 'Age': 23, 'City': 'Noida', 'Score': 92, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}

#### AND and OR

In [21]:
q5 = {'$or' : [ {"City" : "Delhi"}, {"Score" : {"$gt": 80}} ]}
for i in col.find(q5):
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e34'), 'Name': 'Vipul', 'Age': 25, 'City': 'Noida', 'Score': 83, 'Dept': 'HR'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Age': 24, 'City': 'Bangalore', 'Score': 94, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360df13c570d4ceb9bd88e3'), 'Name': 'Anshul', 'Age': 23, 'City': 'Noida', 'Score': 92, 'Dept': 'IT'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e4'), 'Name': 'Jatin', 'Age': 22, 'City': 'Delhi', 'Score': 75, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e5'), 'Name': 'Kritika', 'Age': 24, 'City': 'Pune', 'Score': 87, 'Dept': 'HR'}

In [22]:
q6 = {'$and' : [ {"City" : "Delhi"}, {"Score" : {"$gt": 80}} ]}
for i in col.find(q6):
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}

#### IN

In [24]:
q7 = {'City' : {"$in" : ["Bangalore",'Noida']}}
for i in col.find(q7):
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e34'), 'Name': 'Vipul', 'Age': 25, 'City': 'Noida', 'Score': 83, 'Dept': 'HR'}
{'_id': ObjectId('6360dad9264a20f883771e39'), 'Name': 'Akanksha', 'Age': 25, 'City': 'Noida', 'Score': 70, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Age': 24, 'City': 'Bangalore', 'Score': 94, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360df13c570d4ceb9bd88e3'), 'Name': 'Anshul', 'Age': 23, 'City': 'Noida', 'Score': 92, 'Dept': 'IT'}

#### Limit

In [27]:
q8 = {'Score':{'$gt':80}}
for i in col.find(q8).sort('Score',-1).limit(5):  # top 5 scores in desc order
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Age': 24, 'City': 'Bangalore', 'Score': 94, 'Dept': 'IT'}
{'_id': ObjectId('6360df13c570d4ceb9bd88e3'), 'Name': 'Anshul', 'Age': 23, 'City': 'Noida', 'Score': 92, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e5'), 'Name': 'Kritika', 'Age': 24, 'City': 'Pune', 'Score': 87, 'Dept': 'HR'}

In [32]:
q8 = {'Score':{'$gt':80}}
for i in col.find(q8,{'Name','Score'}).sort('Score',-1).limit(3):  # top 5 scores in desc order
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Score': 94}
{'_id': ObjectId('6360df13c570d4ceb9bd88e3'), 'Name': 'Anshul', 'Score': 92}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Score': 91}

In [33]:
import pandas as pd

In [37]:
res = list(col.find())
print(type(res))

<class 'list'>

In [38]:
print(res[:2])

[{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}, {'_id': ObjectId('6360dad9264a20f883771e34'), 'Name': 'Vipul', 'Age': 25, 'City': 'Noida', 'Score': 83, 'Dept': 'HR'}]

In [42]:
# dict
# list of list, list of dict

df = pd.DataFrame(col.find())
df.head()

                        _id    Name  Age    City  Score Dept
0  6360dad9264a20f883771e33   Ankit   22    Pune     79   IT
1  6360dad9264a20f883771e34   Vipul   25   Noida     83   HR
2  6360dad9264a20f883771e35    Amit   24   Delhi     86   IT
3  6360dad9264a20f883771e36  Nikhil   25   Delhi     65   OP
4  6360dad9264a20f883771e37   Mudit   23  Mumbai     80  LOG

In [40]:
df.shape

(14, 6)

In [44]:
print(len(dir(df)))
print(dir(df))

447
['Age', 'City', 'Dept', 'Name', 'Score', 'T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_REVERSED', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__array_wrap__', '__bool__', '__class__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_add_numeric_operations', '_agg_by_level', '_agg_examples_doc', '_agg_summary_and_see_also_doc', '_aggregate', '_align_frame', '_align_series', '_arith_method', '_attrs', '_box_col_values', '_builtin_table', '_can_fast_transpose', '_check_inplace_and_allows_duplicate_labels', '_check_inplace_setting', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_combine_frame', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_axes_from_arguments', '_construct_result', '_constructor', '_constructor_expanddim', '_constructor_sliced', '_convert', '_count_level', '_cython_table', '_data', '_dir_additions', '_dir_deletions', '_dispatch_frame_op', '_drop_axis', '_drop_labels_or_levels', '_ensure_valid_index', '_find_valid_index', '_flags', '_from_arrays', '_get_agg_axis', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_cleaned_column_resolvers', '_get_column_array', '_get_cython_func', '_get_index_resolvers', '_get_item_cache', '_get_label_or_level_values', '_get_numeric_data', '_get_value', '_getitem_bool_array', '_getitem_multilevel', '_gotitem', '_hidden_attrs', '_id', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_info_repr', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_cached', '_is_copy', '_is_homogeneous_type', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_iset_item', '_item_cache', '_iter_column_arrays', '_ix', '_ixs', '_join_compat', '_logical_func', '_logical_method', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_mgr', '_min_count_stat_function', '_needs_reindex_multi', '_obj_with_exclusions', '_protect_consolidate', '_reduce', '_reindex_axes', '_reindex_columns', '_reindex_index', '_reindex_multi', '_reindex_with_indexers', '_replace_columnwise', '_repr_data_resource_', '_repr_fits_horizontal_', '_repr_fits_vertical_', '_repr_html_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_sanitize_column', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_series', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_item', '_set_value', '_setitem_array', '_setitem_frame', '_setitem_slice', '_slice', '_stat_axis', '_stat_axis_name', '_stat_axis_number', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_dict_of_blocks', '_try_aggregate_string_function', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'applymap', 'asfreq', 'asof', 'assign', 'astype', 'at', 'at_time', 'attrs', 'axes', 'backfill', 'between_time', 'bfill', 'bool', 'boxplot', 'clip', 'columns', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'corrwith', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'eval', 'ewm', 'expanding', 'explode', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'from_dict', 'from_records', 'ge', 'get', 'groupby', 'gt', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'insert', 'interpolate', 'isin', 'isna', 'isnull', 'items', 'iteritems', 'iterrows', 'itertuples', 'join', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lookup', 'lt', 'mad', 'mask', 'max', 'mean', 'median', 'melt', 'memory_usage', 'merge', 'min', 'mod', 'mode', 'mul', 'multiply', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'pivot', 'pivot_table', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'query', 'radd', 'rank', 'rdiv', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'select_dtypes', 'sem', 'set_axis', 'set_flags', 'set_index', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'stack', 'std', 'style', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_feather', 'to_gbq', 'to_hdf', 'to_html', 'to_json', 'to_latex', 'to_markdown', 'to_numpy', 'to_parquet', 'to_period', 'to_pickle', 'to_records', 'to_sql', 'to_stata', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unstack', 'update', 'value_counts', 'values', 'var', 'where', 'xs']

#### Delete one Record

In [45]:
df.iloc[:,1:]

        Name  Age       City  Score Dept
0      Ankit   22       Pune     79   IT
1      Vipul   25      Noida     83   HR
2       Amit   24      Delhi     86   IT
3     Nikhil   25      Delhi     65   OP
4      Mudit   23     Mumbai     80  LOG
5     Arpita   24       Pune     91  INV
6   Akanksha   25      Noida     70  LOG
7       Anuj   22     Mumbai     68   IT
8     Shreya   24  Bangalore     94   IT
9    Rishabh   25  Bangalore     88  INV
10    Anshul   23      Noida     92   IT
11     Jatin   22      Delhi     75  INV
12   Kritika   24       Pune     87   HR
13     Akash   26     Mumbai     56  LOG

In [46]:
# Deletes the first record
dq1 = {'City':'Noida'}
col.delete_one(dq1)

for i in col.find():
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}
{'_id': ObjectId('6360dad9264a20f883771e37'), 'Name': 'Mudit', 'Age': 23, 'City': 'Mumbai', 'Score': 80, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e39'), 'Name': 'Akanksha', 'Age': 25, 'City': 'Noida', 'Score': 70, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e3a'), 'Name': 'Anuj', 'Age': 22, 'City': 'Mumbai', 'Score': 68, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3b'), 'Name': 'Shreya', 'Age': 24, 'City': 'Bangalore', 'Score': 94, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360df13c570d4ceb9bd88e3'), 'Name': 'Anshul', 'Age': 23, 'City': 'Noida', 'Score': 92, 'Dept': 'IT'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e4'), 'Name': 'Jatin', 'Age': 22, 'City': 'Delhi', 'Score': 75, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e5'), 'Name': 'Kritika', 'Age': 24, 'City': 'Pune', 'Score': 87, 'Dept': 'HR'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e6'), 'Name': 'Akash', 'Age': 26, 'City': 'Mumbai', 'Score': 56, 'Dept': 'LOG'}

In [47]:
df.iloc[:,1:]

        Name  Age       City  Score Dept
0      Ankit   22       Pune     79   IT
1      Vipul   25      Noida     83   HR
2       Amit   24      Delhi     86   IT
3     Nikhil   25      Delhi     65   OP
4      Mudit   23     Mumbai     80  LOG
5     Arpita   24       Pune     91  INV
6   Akanksha   25      Noida     70  LOG
7       Anuj   22     Mumbai     68   IT
8     Shreya   24  Bangalore     94   IT
9    Rishabh   25  Bangalore     88  INV
10    Anshul   23      Noida     92   IT
11     Jatin   22      Delhi     75  INV
12   Kritika   24       Pune     87   HR
13     Akash   26     Mumbai     56  LOG

#### Delete Multiple record

In [48]:
dq2 = {'Score':{'$gte':92}}
col.delete_many(dq2)

for i in col.find():
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}
{'_id': ObjectId('6360dad9264a20f883771e37'), 'Name': 'Mudit', 'Age': 23, 'City': 'Mumbai', 'Score': 80, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e39'), 'Name': 'Akanksha', 'Age': 25, 'City': 'Noida', 'Score': 70, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e3a'), 'Name': 'Anuj', 'Age': 22, 'City': 'Mumbai', 'Score': 68, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e4'), 'Name': 'Jatin', 'Age': 22, 'City': 'Delhi', 'Score': 75, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e5'), 'Name': 'Kritika', 'Age': 24, 'City': 'Pune', 'Score': 87, 'Dept': 'HR'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e6'), 'Name': 'Akash', 'Age': 26, 'City': 'Mumbai', 'Score': 56, 'Dept': 'LOG'}

#### Update One

In [49]:
old = { "Name": "Anuj" }
new = { "$set": { "Dept": "Admin", "Age" : 27 }}

col.update_one(old, new)

for x in col.find():
    print(x)

{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}
{'_id': ObjectId('6360dad9264a20f883771e37'), 'Name': 'Mudit', 'Age': 23, 'City': 'Mumbai', 'Score': 80, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e39'), 'Name': 'Akanksha', 'Age': 25, 'City': 'Noida', 'Score': 70, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e3a'), 'Name': 'Anuj', 'Age': 27, 'City': 'Mumbai', 'Score': 68, 'Dept': 'Admin'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e4'), 'Name': 'Jatin', 'Age': 22, 'City': 'Delhi', 'Score': 75, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e5'), 'Name': 'Kritika', 'Age': 24, 'City': 'Pune', 'Score': 87, 'Dept': 'HR'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e6'), 'Name': 'Akash', 'Age': 26, 'City': 'Mumbai', 'Score': 56, 'Dept': 'LOG'}

#### Update Many

In [51]:
old = { "City":  'Mumbai' }
new = { "$set": { "Age": 25 } }

col.update_many(old, new)

for i in col.find():
    print(i)

{'_id': ObjectId('6360dad9264a20f883771e33'), 'Name': 'Ankit', 'Age': 22, 'City': 'Pune', 'Score': 79, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e35'), 'Name': 'Amit', 'Age': 24, 'City': 'Delhi', 'Score': 86, 'Dept': 'IT'}
{'_id': ObjectId('6360dad9264a20f883771e36'), 'Name': 'Nikhil', 'Age': 25, 'City': 'Delhi', 'Score': 65, 'Dept': 'OP'}
{'_id': ObjectId('6360dad9264a20f883771e37'), 'Name': 'Mudit', 'Age': 25, 'City': 'Mumbai', 'Score': 80, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e38'), 'Name': 'Arpita', 'Age': 24, 'City': 'Pune', 'Score': 91, 'Dept': 'INV'}
{'_id': ObjectId('6360dad9264a20f883771e39'), 'Name': 'Akanksha', 'Age': 25, 'City': 'Noida', 'Score': 70, 'Dept': 'LOG'}
{'_id': ObjectId('6360dad9264a20f883771e3a'), 'Name': 'Anuj', 'Age': 25, 'City': 'Mumbai', 'Score': 68, 'Dept': 'Admin'}
{'_id': ObjectId('6360dad9264a20f883771e3c'), 'Name': 'Rishabh', 'Age': 25, 'City': 'Bangalore', 'Score': 88, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e4'), 'Name': 'Jatin', 'Age': 22, 'City': 'Delhi', 'Score': 75, 'Dept': 'INV'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e5'), 'Name': 'Kritika', 'Age': 24, 'City': 'Pune', 'Score': 87, 'Dept': 'HR'}
{'_id': ObjectId('6360e01dc570d4ceb9bd88e6'), 'Name': 'Akash', 'Age': 25, 'City': 'Mumbai', 'Score': 56, 'Dept': 'LOG'}